generated/about.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>about us</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">about us</h1>
<nav class="navbar">
<ul>
<li><a href="index.html">home</a></li>
<li><a href="about.html">about</a></li>
</ul>
</nav>
<p>
&ldquo;Us&rdquo; is a bit overstating the situation. Currently it&rsquo;s only me but the plan is to create a place where development and manufacture of personal &ldquo;one item&rdquo; products for your electronic collection of musical instruments and form-factor it as you want. There is a Eurorack System format currently at a pre-production stage with the ambition to get it mass produced.<br />
</p>

<p>
My name is Nick, a Mechanical Engineer whose love for programming started late. My bachelor thesis involved signal post-processing for EMI filtering from electric motors used in the experimental setup. I was lucky enough to have a diverse curriculum and among them were basic IoT device building on a simulator, a punching tool on a lathe <b>with knurling</b> now gifted to a friend and other interesting stuff. My thesis supervisor, <i>whom I have to kindly ask for naming him here</i>, created the turning point and let me explore the early stages of programming helping a lot to untangle the thread of implementing signal processing with the help of other libraries where python wasn&rsquo;t fast enough (hey scipy, it&rsquo;s been a while).<br />
</p>

<p>
Then it was about time to transfer all this knowledge to more constrained environments and high level abstractions got in the way due to lack of flash and ram on powerful mcu&rsquo;s which are getting overlooked. <a href="https://bogdanthegeek.github.io/blog/projects/vapeserver/">A cortex-m0+ can host a website</a> so this is not some block diagrams on a infinitely digital board but hardware capable of crunching numbers. STMicroelectronics was kind enough to stash a nice timer peripheral in stm32g071xx&rsquo;s among <a href="https://pichenettes.github.io/mutable-instruments-documentation/tech_notes/stm32_miscellania/">other reasons</a>.<br />
</p>
<div id="outline-container-org94f8dac" class="outline-2">
<h2 id="org94f8dac">and this is our coding style</h2>
<div class="outline-text-2" id="text-org94f8dac">
<div class="org-src-container">
<pre class="src src-C"><code><span style="color: #ffffff;">static</span> <span style="color: #ffffff;">inline</span> <span style="color: #8cde94;">bool</span> <span style="color: #ffffff;">read_gpio</span>(<span style="color: #ffffff;">struct</span> <span style="color: #8cde94;">gpio</span> *<span style="color: #c1d1e3;">g</span>){
    <span style="color: #ffffff;">return</span> (pin-&gt;port_id-&gt;IDR &amp; (1U &lt;&lt; pin-&gt;id) ? 1U : 0);
}
<span style="color: #8cde94;">int</span> <span style="color: #ffffff;">main</span>(<span style="color: #8cde94;">void</span>){
    <span style="color: #44b340;">/* </span><span style="color: #44b340;">there is a struct gpio my_beautiful_pin_struct somewhere declared and initialized here before this call</span><span style="color: #44b340;"> */</span>
    <span style="color: #8cde94;">uint32_t</span> <span style="color: #c1d1e3;">some</span> = read_gpio(&amp;my_beautiful_pin_struct);
    <span style="color: #ffffff;">return</span> 0;
}
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org6b83f98" class="outline-2">
<h2 id="org6b83f98">contact info</h2>
<div class="outline-text-2" id="text-org6b83f98">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">irc.libera.chat</th>
<th scope="col" class="org-left">email</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">#awfulbytes</td>
<td class="org-left">goodvibrations32 &lt;at&gt; awfulbytes &lt;dot&gt; org</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</body>
</html>
